In [ ]:
import pandas as pd

In [ ]:
# 1. Write a function that takes start and end of a range returns a Pandas series object containing numbers within that range.

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
def seriesFunction(a=1,b=10):
    data = np.arange(a,b)
    ser = pd.Series(data)
    return ser

In [ ]:
serObj = seriesFunction(5)
serObj
print("Series Object : \n",serObj)
print("\nSeries Object type : \n",type(serObj))

Series Object :
 0    5
1    6
2    7
3    8
4    9
dtype: int64

Series Object type :
 <class 'pandas.core.series.Series'>

In [ ]:
# 2. Create a function that takes in two lists named keys and values as arguments.
# Keys would be strings and contain n string values. Values would be a list containing n lists.

In [ ]:
def listFunction(list1, list2):
   df = pd.DataFrame(list2, columns=list1)
   return df

In [ ]:
list1 = ['EmpNo','Name','Salary']
list2 = [[1,'Akhil', 8000],[2,'Abhi', 9000],[3,'Ajay',10000]]

df1 = listFunction(list1, list2)
df1

   EmpNo   Name  Salary
0      1  Akhil    8000
1      2   Abhi    9000
2      3   Ajay   10000

In [ ]:
# 3. Create a function that concatenates two dataframes. 
# Use previously created function to create two dataframes and pass them as parameters.
# Make sure that the indexes are reset before returning:

In [ ]:
def concatDF(df1,df2):
   df = pd.concat([df1,df2],axis=1)
   return df

In [ ]:
list1 = ['EmpNo','Name','Salary']
list2 = [[1,'Akhil', 8000],[2,'Abhi', 9000],[3,'Ajay',10000]]
list3 = [[1,'Avinash', 8000],[2,'Ashok', 9500],[3,'Ram',10000]]

df1 = listFunction(list1, list2)
df2 = listFunction(list1, list3)

df = concatDF(df1,df2) 
df

   EmpNo   Name  Salary  EmpNo     Name  Salary
0      1  Akhil    8000      1  Avinash    8000
1      2   Abhi    9000      2    Ashok    9500
2      3   Ajay   10000      3      Ram   10000

In [ ]:
# 4. Write code to load data from cars.csv into a dataframe and print it's details. 
# Details like: 'count', 'mean', 'std', 'min', '25%', '50%', '75%', 'max'.

In [ ]:
data = pd.read_csv("cars.csv")
data.describe()

            S.No        mpg        cyl  ...         am       gear     carb
count  32.000000  32.000000  32.000000  ...  32.000000  32.000000  32.0000
mean   16.500000  20.090625   6.187500  ...   0.406250   3.687500   2.8125
std     9.380832   6.026948   1.785922  ...   0.498991   0.737804   1.6152
min     1.000000  10.400000   4.000000  ...   0.000000   3.000000   1.0000
25%     8.750000  15.425000   4.000000  ...   0.000000   3.000000   2.0000
50%    16.500000  19.200000   6.000000  ...   0.000000   4.000000   2.0000
75%    24.250000  22.800000   8.000000  ...   1.000000   4.000000   4.0000
max    32.000000  33.900000   8.000000  ...   1.000000   5.000000   8.0000

[8 rows x 12 columns]

In [ ]:
# 5. Write a method that will take a column name as argument and return the name of the column with which the
# given column has the highest correlation.

In [ ]:
def maxcorrFunction(colName):
    print("Column Name passed as argument  :", colName)
    rowDetails = data.corr().loc[colName]
    #print("Row details :\n", rowDetails)
    rDetails = rowDetails.drop(colName)
    #print("After droping :\n",rDetails)
    maxcorName = rDetails.idxmax()
    maxcorValue = rDetails.max()
    print("Max Label & Value  :\n",maxcorName, " : ",maxcorValue)
    return maxcorName

In [ ]:
cName = "hp"
name = maxcorrFunction(cName)
print("Name of the column which has the highest correlation :\n", name)

Column Name passed as argument  : hp
Max Label & Value  :
 cyl  :  0.8324474527218194
Name of the column which has the highest correlation :
 cyl

In [ ]:
data.corr()

          S.No       mpg       cyl  ...        am      gear      carb
S.No  1.000000  0.084699 -0.028882  ...  0.354905  0.400825  0.174576
mpg   0.084699  1.000000 -0.852162  ...  0.599832  0.480285 -0.550925
cyl  -0.028882 -0.852162  1.000000  ... -0.522607 -0.492687  0.526988
disp -0.022048 -0.847551  0.902033  ... -0.591227 -0.555569  0.394977
hp    0.242295 -0.776168  0.832447  ... -0.243204 -0.125704  0.749812
drat  0.240952  0.681172 -0.699938  ...  0.712711  0.699610 -0.090790
wt   -0.162419 -0.867659  0.782496  ... -0.692495 -0.583287  0.427606
qsec -0.376658  0.401294 -0.579882  ... -0.288955 -0.207942 -0.616964
vs   -0.109162  0.664039 -0.810812  ...  0.168345  0.206023 -0.569607
am    0.354905  0.599832 -0.522607  ...  1.000000  0.794059  0.057534
gear  0.400825  0.480285 -0.492687  ...  0.794059  1.000000  0.274073
carb  0.174576 -0.550925  0.526988  ...  0.057534  0.274073  1.000000

[12 rows x 12 columns]